app/views/films/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE ("comments".film_id = 1)
---
	<h3> <%= film.tytul %></h3><br />
 <b>Reżyseria</b> <%= film.rezyseria %><br /><%= ratings_for film, :static %> (Głosów: <%= film.rates.count %>) ( Komentarze: <b><%= film.comments.count %></b> )<br />