app/views/films/show.html.erb

SELECT "comments".* FROM "comments" WHERE ("comments".film_id = 1)
SELECT COUNT(*) FROM "comments" WHERE ("comments".film_id = 1)
---
 <% if user_signed_in? %>
<% if @film.comments.any? %>