app/controllers/comments_controller.rb

  def create
    @comment = @film.comments.new params[:comment]
    @comment.save
---
INSERT INTO "comments" ("film_id", "author", "body", "created_at", "updated_at", "email") VALUES (1, NULL, 'bla', '2011-01-08 21:50:38.420037', '2011-01-08 21:50:38.420037', 'dodziapio@gmail.com')

  def destroy
    @comment = @film.comments.find params[:id]
    @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE ("comments".film_id = 1) AND ("comments"."id" = 6) LIMIT 1
DELETE FROM "comments" WHERE ("comments"."id" = 6)