app/controllers/films_controller.rb

def index
  @films= Film.search(params[:search]).order('created_at desc').paginate(:per_page => 4, :page => params[:page])
---
SELECT "films".* FROM "films" WHERE ((tytul || rezyseria) like '%z%') ORDER BY created_at desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "films"

def tags
@films = Film.tagged_with(params[:name]).order().paginate(:per_page => 4, :page => params[:page])
---
SELECT "films".* FROM "films" JOIN taggings films_taggings_melodramat_12 ON films_taggings_melodramat_12.taggable_id = films.id AND films_taggings_melodramat_12.taggable_type = 'Film' AND films_taggings_melodramat_12.tag_id = 6 LIMIT 4 OFFSET 0
SELECT tags.*, COUNT(*) AS count FROM "tags" LEFT OUTER JOIN taggings ON tags.id = taggings.tag_id AND taggings.context = 'tags' INNER JOIN films ON films.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Film') AND (taggings.taggable_id IN(SELECT films.id FROM "films")) GROUP BY tags.id, tags.name HAVING COUNT(*) > 0

  def show
    @film = Film.find(params[:id])
---
SELECT "films".* FROM "films" WHERE ("films"."id" = 1) LIMIT 1

  def edit
    @film = Film.find(params[:id])
---
SELECT "films".* FROM "films" WHERE ("films"."id" = 1) LIMIT 1

  def create
    @film = Film.new(params[:film])

	    respond_to do |format|
      if @film.save
---
INSERT INTO "films" ("tytul", "rezyseria", "scenariusz", "obsada", "kraj_produkcji", "opis_filmu", "created_at", "updated_at", "photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at", "data", "tytul_orginalny") VALUES ('Incepcja', 'Christopher Nolan', 'Christopher Nolan', 'dicaprio', 'usa', '', '2011-01-08 21:50:16.815801', '2011-01-08 21:50:16.815801', '7327608.2.jpg', 'image/jpeg', 15242, '2011-01-08 21:50:15.975753', '2011-01-12', 'Inception')

  def update
    @film = Film.find(params[:id])
    if @film.update_attributes(params[:film])
---
SELECT "films".* FROM "films" WHERE ("films"."id" = 7) LIMIT 1
UPDATE "films" SET "data" = '1966-12-22', "updated_at" = '2011-01-10 03:57:18.960606' WHERE ("films"."id" = 7)

  def destroy
    @film = Film.find(params[:id])
    @film.destroy
---
SELECT "films".* FROM "films" WHERE ("films"."id" = 2) LIMIT 1
DELETE FROM "films" WHERE ("films"."id" = 2)

   def rate
    @film = Film.find(params[:id])
---
SELECT "films".* FROM "films" WHERE ("films"."id" = 1) LIMIT 1