app/controllers/films_controller.rb

SELECT "films".* FROM "films" WHERE ((tytul || rezyseria) like '%mmmmm%') LIMIT 5 OFFSET 0
---
def index
  @films= Film.search(params[:search]).order().paginate(:per_page => 5, :page => params[:page])